Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: I know that Marco has been sick.
jbo: mi djuno lo du'u la.mark. pu bilma

source: I think that it's too big.
jbo: pe'i dukse barda

source: I understand now.
jbo: mi co'a jimpe

source: Let's go to Shinjuku tomorrow morning.
jbo: .e'u mi'o klama la cinjukus. ca lo bavlamdei cerni

source: The company invested a lot of money in this project.
jbo: le kagni cu zivle loi mutce jdini le gungunma

source: You're weird - I like you.
jbo: do gemu'i cizra gi se nelci mi

source: You live and learn.
jbo: ca'oku do jmive gije cilre

source: He is proficient in Farsi.
jbo: ko'a certu se bangu la .farsis.

source: I like sushi.
jbo: mi nelci lo cidjrsuci .i'e

source: I killed God.
jbo: mi catra la.cev.

source: I need friends.
jbo: mi nitcu lo pendo

source: Huh? Or maybe did how many of what do what how? What do you think?
jbo: pau je'i xu ki'a cu'e mo fi'a xo ma pei

source: Would you like some tea or coffee?
jbo: xu do djica lo nu pinxe lo tcati a lo ckafi

source: Please take me away from here!
jbo: .e'o ko bevri mi fo ti

source: Is this a newspaper or a magazine?
jbo: ti nuzykarni gi'i xrakarni

source: I came here to study.
jbo: mi klama ti ki'u tu'a le nu tadni

source: These flowers you see are roses.
jbo: loi vi xrula poi do viska cu rozgu

source: The girl playing the piano is named Akiko.
jbo: le nixli be sepi'o le pipno cu selcmene zoi ny. akiko .ny.

source: Do you go running daily?
jbo: xu do bajra ca ro djedi

source: I see a book.
jbo: mi viska lo cukta

source: And if the vacuum explodes, it is called a black hole.
jbo: lo kunti be roda ganai spoja gi se cmene lu xekri kevna li'u

source: You're looking at that tree.
jbo: do ca catlu lo va tricu

source: I never lie.
jbo: mi no roi ticysku

source: Love is a lie.
jbo: lo nu prami cu tcica

source: Love is a trick.
jbo: lo nu prami cu tcica

source: Love doesn't exist.
jbo: lo nu prami na zasti

source: I hate you.
jbo: mi xebni do

source: I'm interested in why bears are important to Lojbanists.
jbo: .a'u lo cribe cu vajni lo jbopre ma

source: Tux is an Antarctic bird.
jbo: la tuks. dzipo cipni

source: Cut the cake with that knife.
jbo: gau ko lo dakfu cu katna lo titnanba

source: Why don't you say "Friend"? It's always sufficient
jbo: mu'i ma do na cusku lu pendo li'u .i lo nu go'i cu roroi banzu

source: Why don't you say "Friend"? Saying it is always enough.
jbo: mu'i ma do na cusku lu pendo li'u .i lo nu go'i cu roroi banzu

source: Oh yes, we love the computer voice!
jbo: .uicai mi'o prami lo skami voksa

source: I just ate sushi and drank beer.
jbo: puziki citka lo cidjrsuci .ije pinxe lo xribirje

source: She just ate sushi and drank beer.
jbo: puziki citka lo cidjrsuci .ije pinxe lo xribirje

source: He just ate sushi and drank beer.
jbo: puziki citka lo cidjrsuci .ije pinxe lo xribirje

source: We just ate sushi and drank beer.
jbo: puziki citka lo cidjrsuci .ije pinxe lo xribirje

source: When he saw that there was nothing more to see, he took his bike and rode home.
jbo: ba lo nu facki lo du'u ba'o viska ro zo'e ku kei ra cpacu lo ri relxilma'e gi'e klama le zdani

source: Jean-Luc gives Beverly the book by Shakespeare.
jbo: la janlik. cu dunda lo cukta be fi la ceikspir. la bevrlis.

source: Yesterday morning I ate a waffle!
jbo: .i ui ca lo prulamdei cerni mi citka lo nanbrxuafla

source: Mr. Wang is Chinese.
jbo: la.uan. jungo

source: Apparently the bus was late.
jbo: za'a tu'a lo basfa cu lerci

source: That cheese is made from goat's milk.
jbo: ta cilra lo ladru be lo kanba

source: He's fast.
jbo: ko'a sutra

source: He explained the literal meaning of the sentence.
jbo: ko'a ciksi lo pe'anai smuni be le jufra

source: Qo'noS is the home planet of the Klingons.
jbo: la koknoc. terdi lai klingon.

source: I have at least one house.
jbo: mi ralte pa lo zdadi'u

source: Oh no! I just spent so much money!
jbo: .oi so'i da zi jdima fi mi

source: When will your new novel come out?
jbo: ca ma ckupra lo do cnino brafi'a

source: Real men drink tea.
jbo: lo mutce nanmu cu pinxe lo tcati

source: Lojbanistan borders Esperantujo.
jbo: da korbi la .lojbangug. la .esperantu,ion.

source: Paul was born in Rome.
jbo: la paulus. cu jbena fo la romas.

source: I love you more than I love any other person.
jbo: do zmadu ro drata prenu loka mi prami

source: Is that your book?
jbo: xu do se srana lo va cukta

source: Wait! One! Two! Five--I mean, Three! Throw!
jbo: ko denpa .i pa .i re .i mu si ci .i renro

source: She isn't alone anymore.
jbo: ra ba'o nonkansa

source: He isn't alone anymore.
jbo: ra ba'o nonkansa

source: She isn't lonely anymore.
jbo: ra ba'o seicni

source: He isn't lonely anymore.
jbo: ra ba'o seicni

source: English is hard, isn't it?
jbo: lo glibau cu nandu vau je'u pei

source: I forgot to turn off the television before going to bed.
jbo: mi tolmo'i lo ka sazysti le veltivyvidni kei pu lo nu mi ckakla

source: She is beautiful like her mother.
jbo: ko'a simsa le ko'a mamta loka melbi

source: I will always love you.
jbo: mi do ze'e prami

source: I became acquainted with beautiful Polish women at the university in Brazil, and I also met there some very friendly people who could speak Polish.
jbo: va'o lo balcu'e be bu'u lo razgu'e mi se co'arsau lo melbi ke gugdrpolska ninmu gi'e ji'a penmi lo xe'otce poi se bangrpolska

source: I will learn.
jbo: mi ba cilre

source: That is very expensive!
jbo: ta mutce kargu

source: I never read that book.
jbo: mi no roi tcidu fi lo bi'unai cukta

source: Luke, I am your father.
jbo: doi luk. mi patfu do

source: I've been studying in China for ten months.
jbo: mi tadni bu'u la .djunguos. ze'a lo masti be li pano

source: I am the law!
jbo: le'o mi flalu

source: You're beautiful.
jbo: iu do melbi

source: Horses and donkeys are different.
jbo: .i lo xirma ce lo xasli cu datsi'u

source: You should stay in bed with your husband.
jbo: ei do stali bu'u lo ckana ka'ai lo be do speni

source: I think that the Quechua flag is beautiful.
jbo: pe'i lo lanci be lo banke'u'e cu melbi

source: Sing something, please.
jbo: pe'u do sanga

source: I'm satisfied with my salary.
jbo: mi se mansa le se jerna be mi

source: I can read English.
jbo: mi kakne lo nu tcidu bau lo glibau

source: The boy is jumping.
jbo: le nanla cu plipe

source: I'm no expert.
jbo: mi na certu

source: Knowing is nothing, imagination is everything.
jbo: lo ka djuno cu vajni no da.i lo ka xarpei cu vajni ro da

source: The man that I see is very tall.
jbo: le nanmu poi mi viska cu mutce rajycla

source: Who said that?
jbo: ma cusku

source: I hate my job.
jbo: mi xebni lo mi jibri

source: Are people comfortable? No.
jbo: xu lo prenu cu kufra .i na go'i

source: Cats hate water.
jbo: lo mlatu cu xebni loi djacu

source: It is true that Rosa had a glass of wine.
jbo: je'u la .rosas. pu pinxe lo kadri be lo vanju

source: The little girl lived in Brazil.
jbo: lo vi nixli cu xabju lo razgu'e

source: My name is Maria Sara.
jbo: mi'e mari'as.saras.

source: I don't have enough money.
jbo: mi ponse le rupnu be li mo'a

source: I go to work.
jbo: mi klama lo briju

source: The men are generally tired when they come back from work.
jbo: loi nanmu su'a cu tatpi lo nu vo'a klama fi lo briju

source: I will help you.
jbo: mi ba sidju do

source: She fucked me by surprise.
jbo: ko'a noi ninmu kei pu gletu be mi co spaji

source: The boy is eating bread.
jbo: lo nanla ca citka lo nanba

source: This book is mine. Where is yours?
jbo: lo vi cukta cu me mi moi .i lo me do moi ma zvati

source: This little girl lives in Brazil.
jbo: lo vi nixli cu xabju lo razgu'e

source: My back hurts.
jbo: cortu lo bekpi be mi

source: There is no sugar here.
jbo: lo sakta na zvati

source: What are you having for lunch today?
jbo: ca lo cabdei lo dormijysai be ma cu se citka do

source: What will you have for lunch today?
jbo: ca lo cabdei lo dormijysai be ma cu se citka do

source: Few of her friends live in Kyoto.
jbo: so'u pendo be ra cu xabju la kioton.

source: This man has a horse.
jbo: lo vi nanmu cu ralte lo xirma

source: She brushes her hair in the morning.
jbo: ra brulu'i lo be ri kerfa ca lo cerni

source: Don't cross the street!
jbo: ko na kruca le klaji

source: Dr. George's secretary is Japanese.
jbo: le la mic. djordj. ci'arse'u cu ponjo

source: I'm not a magician.
jbo: mi na te makfa

source: The station is two meters away.
jbo: .i lo mitre be li re zo'u lutnilcla fi lo tcana

source: She accompanied him to Japan.
jbo: .i pongu'e klama kansa

source: She danced with him.
jbo: ko'a pu dansu ka'ai ko'e

source: She gave him a book.
jbo: ko'a co'i dunda lo cukta ko'e

source: She isn't kind to him. In fact, she's not kind to anyone.
jbo: ko'a na xendo ko'e .i ju'o ko'a na xendo lo prenu

source: She missed him a lot.
jbo: ko'a mutci caucni ko'e

source: She said nothing that would make him angry.
jbo: ko'a cusku noda poi tefengu be fi ko'e

source: She told him to study.
jbo: ko'a cusku lu ko tadni li'u ko'e

source: These charred bits are tasty.
jbo: lo ti tabybi'o djaspi cu kukte

source: The telephone is broken.
jbo: lo fonxa cu spofu

source: Please fix that.
jbo: .e'o do cikre ta

source: You can make sounds by combining letters in Modern Greek. For example you can use to make the sound "b", to make the sound "d", to make the sound "g" and to make the sound "dj".
jbo: so'o da re lerfu fi so'o sance bau la ninxesybau .i mu'a mypy ge'o go'i fi lo sance pe by .ije nyty ge'o go'i fi lo sance pe dy .ije gyky ge'o go'i fi lo sance pe gy .ije tyzy ge'o go'i fi lo sance pe dyjy

source: That's Tony's book.
jbo: lo va cukta selpo'e la .tonis.

source: Nothing is holy.
jbo: no da censa zi'o

source: If you are late in the morning, you will be late the whole day.
jbo: lo nu lerci fa lo nu da cikybi'o cu nibli lo nu lerci fa lo nu de cuntu da

source: I want to die with Getter Jaani.
jbo: .au mi kansa la.geter.ianis. lo nu mrobi'o

source: Aah, I'm somewhat angry!
jbo: .o'onairu'e mi milxe fengu

source: There is neither God nor Buddha.
jbo: lo cevni na.enai la .budas. zasti

source: The children should go outside and play.
jbo: .e'u loi verba cu barkla je kelci

source: Please have some pie.
jbo: fi'i ko citka loi nabypalne

source: There are more than 50,000 books in this library.
jbo: vi ckusro lo me'i munoki'o mei

source: Everyone makes mistakes sometimes.
jbo: ro lo prenu ru'inai srera

source: I prefer not to eat meat because I'm vegetarian.
jbo: mi na cidja loi rectu .imu'ibo nalre'ucti

source: Commit these words to memory.
jbo: ko morji ti poi valsi

source: But he really wanted a son.
jbo: ku'i pu mutce djica tu'a lo bersa

source: They make toys at this factory.
jbo: ti fanri loi keltci

source: He is almost always home.
jbo: piso'aroi zdani zvati

source: I compared this picture with that one.
jbo: mi karbi ti poi pixra ku'o ta poi pixra

source: Whos coming with me?
jbo: ma ba klama kansa mi

source: The end is nigh.
jbo: lo fanmo ku jibni

source: Ive started learning Esperanto.
jbo: mi puzi co'a cilre fi lo bangepu'o

source: I love Monday!
jbo: mi nelci ba'e lo pavdei

source: Why won't my dog eat dog food?
jbo: mu'i ma lo mi gerku ku na cikta lo gerku cidja

source: Iceland has many volcanoes.
jbo: la islant cu stuzi so'i lo vulkano

source: I don't want to drink anything cold.
jbo: mi na djica lonu mi pinxe lo lenku

source: What's your favorite web browser?
jbo: ma poi brauzero cu se ke mutce nelci do

source: Please show me another camera.
jbo: .e'o do jarco lo drata kacma ku mi

source: Lech is interested in history.
jbo: la .lex. cu se cinri lo citri saske

source: Not every man can be happy.
jbo: lo nu ro nanmu cu gleki cu na cumki

source: I'm happy enough.
jbo: mi banzu gleki

source: Foolish, foolish me.
jbo: bebna bebna fa mi

source: I just started to learn Esperanto.
jbo: mi puzi co'a cilre fi lo bangepu'o

source: Please say that again!
jbo: .e'o cusku krefu

source: When I met Anka in Bucharest she was studying.
jbo: ca lo nu mi penmi la .ankas. goi ko'a la bukurectis. kei ko'a ca'o tadni

source: It's very expensive.
jbo: ti mutce kargu

source: It's time to sleep.
jbo: ca tcika lo nu ei sipna

source: You speak.
jbo: do bacru

source: My wife isn't beautiful. Yours is.
jbo: le speni be mi na.e do cu melbi

source: The tea is boiling hot.
jbo: le tcati ca febvi glare

source: I paid her five dollars.
jbo: mi pleji mu rupnu ko'a

source: She talked a lot.
jbo: ko'a pu cusku so'i da

source: I don't want to go to Italy.
jbo: mi na djica lonu klama la italias.

source: Regrettably, he lacks the financial wherewithal to run a presidential campaign.
jbo: uinai ra claxu lo jdini co banzu be lo nu se cuntu co presidento

source: Don't cry.
jbo: ko na klaku

source: Have you ever driven a sports car?
jbo: xu do ca da pu sazri lo esporte karce

source: I don't eat chicken skin.
jbo: mi na citka lo jipci skapi

source: I don't want to talk to you.
jbo: .aunai mi tavla do

source: I love the fact that you love me.
jbo: mi prami lodu'u do prami mi

source: I wish I could figure out how to delete my Facebook account.
jbo: mi djica lo nu mi kakne lo nu mi djuno fi lo nu vimcu la'o gy facebook account gy pe mi

source: Is eating people wrong?
jbo: xu palci fa lo nu citka lo remna

source: It's worth a try, right?
jbo: vamji fa lo nu troci i je'upei

source: Stress can have an enormous negative impact on your health.
jbo: tu'a lo ka dunku cu cumri'a lo nu tcemalcne lo ka kanro

source: These books aren't for children.
jbo: lo vi cukta na sela'a lo verba

source: We believe the time of death was 2:20 p.m.
jbo: mi'ai krici lodu'u lo nu morsi ku se tcika li re pi'e reno ba lo djedi midju

source: Would you like to hear the story about Paul Bunyan?
jbo: .au pei do ve lisri la .pol banian.

source: You shouldn't eat raw snails.
jbo: do einai citka lo na'e se jukpa cakcurnu

source: I'm drunk.
jbo: mi xalbebna

source: I'm studying French and web design.
jbo: ca tadni lo fasybau .e lo kibro dumpla

source: We're studying French and web design.
jbo: ca tadni lo fasybau .e lo kibro dumpla

source: He's studying French and web design.
jbo: ca tadni lo fasybau .e lo kibro dumpla

source: She's studying French and web design.
jbo: ca tadni lo fasybau .e lo kibro dumpla

source: They're studying French and web design.
jbo: ca tadni lo fasybau .e lo kibro dumpla

source: Peter wanted to become a doctor.
jbo: .i la. pitr. pu mikce binxo djica

source: Which is the most difficult language in the world?
jbo: ma nadrai bangu di'o le mu'ezda

source: Call me if you find something.
jbo: ganai do facki gi ko fonxa cusku fi mi

source: Yesterday I was ill.
jbo: ca lo prulamdei mi bilma

source: I think that it's you.
jbo: pe'i do co'e

source: I love both cats and dogs.
jbo: mi nelci lo mlatu .e lo gerku

source: What did they hit you with?
jbo: ko'a pu darxi do ma

source: "Here's the Robert's reply." "You mean Robert's?" "No, it's the Robert. There's only one."
jbo: lu ti te spuda fi le me la.rab,rt. li'u lu do skudji lu fi la.rab,rt. li'u vau xu li'u lu na go'i .i go'i lu le me la.rab,rt. li'u .i pa da me ra li'u

source: Suddenly, I saw a beautiful bird.
jbo: se suksa lo nu mi viska lo melbi cipni

source: That cat is brown.
jbo: ta poi mlatu cu bunre

source: Do you like strawberries?
jbo: xu do nelci lo fragari

source: This is a horse.
jbo: ti xirma

source: Don't kill yourself.
jbo: na catra ko

source: He just got home.
jbo: ra puzisai tolcliva lo zdani

source: Everything is expensive here.
jbo: ro da kargu vi

source: Are they live?
jbo: cabyfau xu

source: That is my book.
jbo: mi ralte ta poi cukta

source: I drink coffee.
jbo: mi pinxe lo ckafi

source: I'm utterly sorry!
jbo: .u'ucai

source: I hate the world because the world hates me.
jbo: mi xebni le munje mu'i ledu'u le munje cu xebni mi

source: I'm loved by my parents.
jbo: mi se prami lo rirni be mi

source: Shutting down.
jbo: ca'o sazysti

source: I don't have time now.
jbo: mi ca to'e cando

source: What are you doing tomorrow?
jbo: do ma gasnu ca lo bavlamdei

source: Would you mind not doing that?
jbo: .i .e'o do zukte naku ta

source: He's a historian.
jbo: citri gunka

source: He went backstage after the show.
jbo: ko'a klama le sinti'e ba le nunjarco

source: The sum of 5 and 3 is 8.
jbo: li bi sumji li mu li ci

source: What does Tom really think?
jbo: ma zasti se pensi la tom

source: Was that you I saw with Tom near the river?
jbo: mi viska lo nu do xu kansa la .tom. va lo rirxe

source: Tom was lucky.
jbo: la .tam. pu zanselfu'a

source: Tom was here a while ago.
jbo: la tom. puzavi zvati

source: Tom took a flower out of the vase while no one was looking.
jbo: la .tom. pu lebna lo xrula lo vasru ca lo nu no da ca'o catlu

source: Tom says that learning a foreign language is hard.
jbo: la .tam. cusku lo sedu'u lo zu'o cilre lo fange bangu cu nandu

source: Tom says that he's tired.
jbo: la .tam. cusku lo sedu'u tatpi

source: Tom says that he wants to be buried here.
jbo: la .tam. cusku lo sedu'u djica lo nu ba vi se mrotolkakpa

source: Tom says that he never dreams.
jbo: la .tam. cusku lo sedu'u noroi senva

source: Tom says that he doesn't like children.
jbo: la .tam. cusku lo sedu'u na nelci lo verba

source: Tom says that he doesn't feel like jogging.
jbo: la .tam. cusku lo sedu'u to'e djica lo nu zukybajra

source: Tom says that he detests war.
jbo: la .tam. cusku lo sedu'u xebni lo nunjamna

source: Tom says he's having trouble with his computer.
jbo: la .tam. cusku lo sedu'u se nabmi do'e le skami

source: Tom says he is rich.
jbo: la .tam. cusku lo sedu'u ricfu

source: Tom says he eats more when he's sad.
jbo: la .tam. cusku lo sedu'u zenba lo ka citka ca'o badri ku

source: Tom said that we weren't allowed to take photographs in this museum.
jbo: la .tam. cusku lo sedu'u tolcru lo nu kacmyterxra ne'i lo muzga

source: Tom said that neither one of his parents had ever been to Boston.
jbo: la .tam. cu cusku lo sedu'u le re rirni noroi zvati la .bastn.

source: Tom said that he would come.
jbo: la .tam. cusku lo sedu'u klama

source: Tom said that he was innocent.
jbo: la .tam. cusku lo sedu'u zernalfu'e

source: Tom put the new tablecloth he had just bought on the table.
jbo: la .tam. punji le cnino jbubu'u noi puzi terve'u ke'a ku lo jubme

source: Tom put the key into his pocket.
jbo: la .tam. setca le ckiku le daski

source: Tom put his hat on and went outside.
jbo: la .tam. binxo se sedyta'u je barkla

source: Tom put down his pen.
jbo: la .tam. punji le penbi

source: Tom pushed the door shut.
jbo: la .tam. ganlo catka le vrogai

source: Tom pushed the door open.
jbo: la .tam. kalri catka le vrogai

source: Tom isn't at all selfish.
jbo: la tom nasai sezyselfu

source: Tom is wrong.
jbo: la .tam. jifxu'a

source: Tom is a very smart boy.
jbo: la .tom. mutce stati nanla

source: Tom is a Muslim.
jbo: la tam. muslo

source: Tom has lost his keys.
jbo: la .tam. pu cirko lo ckiku

source: Tom has gone to Boston on urgent business.
jbo: la tam. pu klama la bastyn. mu'i tu'a lo temvai terkagni

source: Tom has a friend whose mother is a veterinarian.
jbo: la tom cu se pendo pa da poi lo mamta be ke'a cu mikce lo danlu

source: Tom had no money.
jbo: la tom cu ponse no lo jdini

source: Tom had a very long day.
jbo: la tom pu jai ke mutce clani djedi

source: Tom forgot to pay the bill.
jbo: la tom. pu tolmo'i fi lo nu jerna lo janta

source: Tom flirted with the waitress.
jbo: la tom pu firca la djabeini'u

source: Tom felt left out.
jbo: la tom. cinmo lo ka sepli

source: Tom drives a black car, doesn't he?
jbo: la tom. xu sazri lo xekri karce

source: Tom doesn't seem to be very tired.
jbo: la tom na simlu lo ka mutce tatpi

source: Tom doesn't often wear a suit.
jbo: lo nu la .tam. dasni lo litcreka cu na cafne

source: Tom doesn't know whether he can do it, but he'll give it a try.
jbo: la tom. goi ko'a na djuno lo jei kakne lo ka broda .i ku'i ko'a ba troci lo ka broda

source: Tom discovered that he had made a mistake.
jbo: la .tam. facki lodu'u ri srera

source: Tom didn't see anything.
jbo: la .tom. pu viska no da

source: Tom didn't know that.
jbo: la tom pu na djuno da bi'unai

source: Tom didn't get up early enough to catch the first train.
jbo: loni lonu la .tom. co'a cikna cu clira na banzu lonu ty. klama fu lo pamoi trene

source: Tom did what I told him to do.
jbo: .i la .tam. tinbe fi mi

source: Tom caught a big fish.
jbo: la tom. pu kavbu lo barda finpe

source: Tom can't find his bag.
jbo: la .tom. na snada lo nu tolcri lo ty dakli

source: Tom can speak French almost as well as he can speak Spanish.
jbo: .i la. tam. se fasybau du'iru'e lo ni ty. se sanbau

source: Tom can sing a few French songs.
jbo: .i la. tam. kakne co sanga su'o lo fraso

source: Tom ate what he wanted.
jbo: la tom pu citka zo'e poi ty pu djica

source: Tom asked a stupid question.
jbo: la .tam. cu cusku lo bebna preti

source: Tom arrived in Boston last night.
jbo: la tom. cu tolcliva la .bastn ca lo prula'i nicte

source: Tom admitted that he was wrong.
jbo: la .tom. pu radji'i lodu'u tu'a ri to'e drani

source: That camera is Tom's most prized possession.
jbo: le va kacma cu traji lo ka dirba la tom goi ko'a kei fo lo'i ko'a selpo'e

source: I doubt that Tom is happy with his new job.
jbo: mi senpi lo du'u la .tam. cu gleki lo ri cnino jibri

source: Tom kissed Mary.
jbo: la .tam. cu cinba la .meris.

source: Tom killed Mary.
jbo: la .tam. pu catra la .meiris.

source: Tom is Mary's grandfather.
jbo: la tom cu rirpa'u la maris

source: Tom is helping Mary.
jbo: la tom ca'o sidju la maris

source: Tom is convinced that Mary is wrong.
jbo: la .tam. cu birti lo du'u la .meiris. jifxu'a

source: Tom invited Mary to dinner.
jbo: la tam pu vi'ecpe la meris tu'a lo vacysai

source: Tom insulted Mary.
jbo: la tom. pu cnixai la meris.

source: Tom has been honest with Mary.
jbo: la tom pujeca stace la maris

source: Tom gave Mary a tender kiss.
jbo: la .tam. cu milxe cinba la .meris.

source: Tom doesn't want any of Mary's money.
jbo: la tom. na djica za'uno jdini po la meris.

source: Tom doesn't know Mary.
jbo: la tom na djuno fi la maris

source: Tom doesn't know either Mary or her sister.
jbo: .i la .tam. na slabu la .meris. .o lo mensi be ri

source: Tom begged Mary to stay.
jbo: la tom pu pikci la maris lo ka stali

source: Mary is Tom's wife.
jbo: la maris. zo'u speni la tom.

source: Mary is Tom's mother.
jbo: la meris. cu mamta la tam

source: Mary is Tom's daughter.
jbo: la meris. cu tixnu la tam

source: I saw Tom kiss Mary.
jbo: mi zgana lo nu la .tam. cu cinba la .meris.

source: I want to go to the city.
jbo: mi djica lo nu klama le tcadu

source: I write a letter.
jbo: mi ciska lo xatra

source: Write down your name with a pencil, please.
jbo: .i .e'o ko ciska lo cmene be do fo lo pinsi

source: If it isn't broken, don't fix it.
jbo: ko na cikre lo na'e spofu

source: He spent a lot of time on Iceland.
jbo: ra ze'u zvati la islant

source: What do you call that contraption?
jbo: le va minji cu selcme ma

source: Big Brother is watching you.
jbo: la barda bruna ca zgana do

source: She has 2,000 books.
jbo: ko'a ralte 2000 lo cukta

source: Tom was tired and in a bad mood.
jbo: la tom pu tatpi gi'e xlali se cnitcini

source: Let's eat now. I'm starving.
jbo: .i ko joi mi ca citka .i mi xagji sai

source: Winter is coming.
jbo: bazi dunra

source: Forty people attended.
jbo: vono lo prenu pu zvati

source: He's really into soccer.
jbo: ta je'a nelci lo si'o boltipyjvi

source: Where is the school?
jbo: ma stuzi le ckule

source: What's the square root of 100?
jbo: ma du li fe'a panono

source: How fascinating!
jbo: .a'ucai

source: I realize I messed up.
jbo: za'a mi pu srera

source: I don't understand your question.
jbo: mi na jimpe fi lo do preti

source: He has friends from many different walks of life.
jbo: ko'a pendo su'o da pe so'i frica jibri
